In [50]:
import mysql.connector

mydb = mysql_connection = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="1234",
    database="testdb"
)

In [51]:
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001E2F903C160>

In [52]:
mycursor = mydb.cursor()

In [53]:
#mycursor.execute("CREATE DATABASE testdb")

In [54]:
"""mycursor.execute("SHOW DATABASES")
for db in mycursor:
    print(db)"""

'mycursor.execute("SHOW DATABASES")\nfor db in mycursor:\n    print(db)'

In [55]:
#mycursor.execute("CREATE TABLE students(name VARCHAR(255), age INTEGER(10))")

In [56]:
mycursor.execute("SHOW TABLES")
for tb in mycursor:
    print(tb)

('students',)

In [57]:
#sqlformula = "INSERT INTO students (name, age) VALUES(%s,%s)"
#student1= ("Rachel",22)

In [58]:
#mycursor.execute(sqlformula, student1)

In [59]:
#mydb.commit()

In [60]:
sqlformula = "INSERT INTO students (name, age) VALUES(%s,%s)"

In [61]:
"""students= [("Ilsa",23),
          ("Hamza Rao",23),
          ("Abid",22),
          ("Irfan",21),
          ("Maryam",20),
          ("Wisha",22),
          ("Mahnoor",21),]"""

'students= [("Ilsa",23),\n          ("Hamza Rao",23),\n          ("Abid",22),\n          ("Irfan",21),\n          ("Maryam",20),\n          ("Wisha",22),\n          ("Mahnoor",21),]'

In [62]:
mycursor.executemany(sqlformula, students)

In [49]:
mydb.commit()

In [63]:
mycursor.execute("SELECT * FROM students")

In [64]:
result = mycursor.fetchall()

In [65]:
for r in result:
    print(r)

('Rachel', 22)
('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Irfan', 21)
('Maryam', 20)
('Wisha', 22)
('Mahnoor', 21)
('Ilsa', 23)
('Hamza Rao', 23)
('Abid', 22)
('Irfan', 21)
('Maryam', 20)
('Wisha', 22)
('Mahnoor', 21)

In [66]:
mycursor.execute("SELECT age FROM students")

In [67]:
result = mycursor.fetchall()

In [68]:
for r in result:
    print(r)

(22,)
(23,)
(23,)
(22,)
(21,)
(20,)
(22,)
(21,)
(23,)
(23,)
(22,)
(21,)
(20,)
(22,)
(21,)

In [70]:
mycursor.execute("SELECT age FROM students")
result = mycursor.fetchone()
for r in result:
    print(r)

22